 
# Data Selection & Filtering

Selecting the right rows and columns is *the first step* in analyzing any dataset. Pandas gives you several powerful ways to do this.

---

## Selecting Rows & Columns

### Selecting Columns

```python
df["column_name"]        # Single column (as Series)
df[["col1", "col2"]]     # Multiple columns (as DataFrame)
```

### Selecting Rows by Index

Use `.loc[]` (label-based) and `.iloc[]` (position-based):

```python
df.loc[0]                # First row (by label)
df.iloc[0]               # First row (by position)
```

### Select Specific Rows and Columns

```python
df.loc[0, "Name"]        # Value at row 0, column 'Name'
df.iloc[0, 1]            # Value at row 0, column at index 1
```

You can also slice:

```python
df.loc[0:2, ["Name", "Age"]]   # Rows 0 to 2, selected columns
df.iloc[0:2, 0:2]              # Rows and cols by index position
```

---

## Fast Access: `.at` and `.iat`

These are optimized for **single element access**:

```python
df.at[0, "Name"]       # Fast label-based access
df.iat[0, 1]           # Fast position-based access
```

---

## Filtering with Conditions

### Simple Condition

```python
df[df["Age"] > 30]
```

### Multiple Conditions (AND / OR)

```python
df[(df["Age"] > 25) & (df["City"] == "Delhi")]
df[(df["Name"] == "Bob") | (df["Age"] < 30)]
```

> Use parentheses around each condition!

---

## Querying with `.query()`

The `.query()` method in pandas lets you filter DataFrame rows using a string expression — it's a more readable and often more concise alternative to using boolean indexing.

This is a cleaner, SQL-like way to filter:

```python
df.query("Age > 25 and City == 'Delhi'")
```

Dynamic column names:

```python
col = "Age"
df.query(f"{col} > 25")
```



Here are the main **rules and tips** for using `.query()` in pandas:

---

### **1. Column names become variables**
You can reference column names directly in the query string:

```python
df.query("age > 25 and city == 'Delhi'")
```

---

### **2. String values must be in quotes**
Use **single** or **double** quotes around strings in the expression:

```python
df.query("name == 'Harry'")
```

If you have quotes inside quotes, mix them:

```python
df.query('city == "Mumbai"')
```

---

### **3. Use backticks for column names with spaces or special characters**
If a column name has spaces, use backticks (`` ` ``):

```python
df.query("`first name` == 'Alice'")
```

---

### **4. You can use `@` to reference Python variables**
To pass external variables into `.query()`:

```python
age_limit = 30
df.query("age > @age_limit")
```

---

### **5. Logical operators**
Use these:
- `and`, `or`, `not` — instead of `&`, `|`, `~`
- `==`, `!=`, `<`, `>`, `<=`, `>=`

Bad:
```python
df.query("age > 30 & city == 'Delhi'")  # ❌
```

Good:
```python
df.query("age > 30 and city == 'Delhi'")  # ✅
```

---

### **6. Chained comparisons**
Just like Python:

```python
df.query("25 < age <= 40")
```

---

### **7. Avoid using reserved keywords as column names**
If you have a column named `class`, `lambda`, etc., you’ll need to use backticks:

```python
df.query("`class` == 'Physics'")
```

---

### **8. Case-sensitive**
Column names and string values are case-sensitive:

```python
df.query("City == 'delhi'")  # ❌ if actual value is 'Delhi'
```

---

### **9. `.query()` returns a **copy**, not a view**
The result is a new DataFrame. Changes won't affect the original unless reassigned:

```python
filtered = df.query("age < 50")
```

---


## Summary

- Use `df[col]`, `.loc[]`, `.iloc[]`, `.at[]`, `.iat[]` to access data  
- Filter with logical conditions or `.query()` for readable code  
- Mastering selection makes the rest of pandas feel easy

In [1]:
import pandas as pd

In [11]:
df = pd.read_csv("data.csv")
df

,Name,Age,Department,Position,Years_Experience,Salary,Performance_Rating,Projects_Completed,Hours_Worked_Per_Week,Education,Location,Skills
0,Shrii,28,Engineering,Senior Developer,5,95000,4.5,23,42,Masters,Bangalore,Python|JavaScript|React
1,Samay,32,Marketing,Marketing Manager,7,88000,4.2,18,38,Bachelors,Mumbai,SEO|Analytics|Content
2,Bhargav,26,Engineering,Junior Developer,2,65000,4.0,12,40,Bachelors,Pune,Java|SQL|Spring
3,Adarsh,35,Finance,Financial Analyst,10,105000,4.8,31,45,MBA,Delhi,Excel|SAP|Forecasting
4,Prabh,29,Design,Lead Designer,6,82000,4.6,27,39,Bachelors,Hyderabad,Figma|Adobe|UI/UX
5,MoneyBhai,41,Finance,CFO,15,185000,4.9,45,50,MBA,Mumbai,Strategy|Finance|Leadership
6,Krish,24,Engineering,Intern,1,45000,3.8,8,35,Bachelors,Bangalore,Python|HTML|CSS

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Name                   7 non-null      object
 1   Age                    7 non-null      int64
 2   Department             7 non-null      object
 3   Position               7 non-null      object
 4   Years_Experience       7 non-null      int64
 5   Salary                 7 non-null      int64
 6   Performance_Rating     7 non-null      float64
 7   Projects_Completed     7 non-null      int64
 8   Hours_Worked_Per_Week  7 non-null      int64
 9   Education              7 non-null      object
 10  Location               7 non-null      object
 11  Skills                 7 non-null      object
dtypes: float64(1), int64(5), object(6)
memory usage: 804.0+ bytes

In [10]:
df.loc[1]

Name                                     Samay
Age                                         32
Department                           Marketing
Position                     Marketing Manager
Years_Experience                             7
Salary                                   88000
Performance_Rating                         4.2
Projects_Completed                          18
Hours_Worked_Per_Week                       38
Education                            Bachelors
Location                                Mumbai
Skills                   SEO|Analytics|Content
Name: 1, dtype: object

In [13]:
df.iloc[1]

Name                                     Samay
Age                                         32
Department                           Marketing
Position                     Marketing Manager
Years_Experience                             7
Salary                                   88000
Performance_Rating                         4.2
Projects_Completed                          18
Hours_Worked_Per_Week                       38
Education                            Bachelors
Location                                Mumbai
Skills                   SEO|Analytics|Content
Name: 1, dtype: object

In [15]:
df.loc[3,"Education"]

'MBA'

In [16]:
df.iloc[3,9]

'MBA'

In [20]:
# For .loc[0:2] 0,1,2 will be output
df.loc[0:2, ["Name", "Education"]]

      Name  Education
0    Shrii    Masters
1    Samay  Bachelors
2  Bhargav  Bachelors

In [21]:
# For .iloc[0:2] 0,1 will be output
df.iloc[0:2, 0:3]

    Name  Age   Department
0  Shrii   28  Engineering
1  Samay   32    Marketing

In [25]:
df.at[5, "Location"]

'Mumbai'

In [36]:
df.iat[5,2]

'Finance'

In [28]:
# Filtering Data
df[df["Hours_Worked_Per_Week"]>45]

,Name,Age,Department,Position,Years_Experience,Salary,Performance_Rating,Projects_Completed,Hours_Worked_Per_Week,Education,Location,Skills
5,MoneyBhai,41,Finance,CFO,15,185000,4.9,45,50,MBA,Mumbai,Strategy|Finance|Leadership

In [29]:
df[df["Hours_Worked_Per_Week"]>45]["Name"]

5    MoneyBhai
Name: Name, dtype: object

In [40]:
# syntax -> .query()
df.query("Salary > 100000 and Location == 'Delhi'")

,Name,Age,Department,Position,Years_Experience,Salary,Performance_Rating,Projects_Completed,Hours_Worked_Per_Week,Education,Location,Skills
3,Adarsh,35,Finance,Financial Analyst,10,105000,4.8,31,45,MBA,Delhi,Excel|SAP|Forecasting

In [41]:
df2 = df.query("Performance_Rating > 4")

In [42]:
df2

,Name,Age,Department,Position,Years_Experience,Salary,Performance_Rating,Projects_Completed,Hours_Worked_Per_Week,Education,Location,Skills
0,Shrii,28,Engineering,Senior Developer,5,95000,4.5,23,42,Masters,Bangalore,Python|JavaScript|React
1,Samay,32,Marketing,Marketing Manager,7,88000,4.2,18,38,Bachelors,Mumbai,SEO|Analytics|Content
3,Adarsh,35,Finance,Financial Analyst,10,105000,4.8,31,45,MBA,Delhi,Excel|SAP|Forecasting
4,Prabh,29,Design,Lead Designer,6,82000,4.6,27,39,Bachelors,Hyderabad,Figma|Adobe|UI/UX
5,MoneyBhai,41,Finance,CFO,15,185000,4.9,45,50,MBA,Mumbai,Strategy|Finance|Leadership

In [45]:
# Since df2 is a copy not a view it will not change original DataFrame and return a new DataFrame
df2.loc[0,"Name"] = "Krrish"
df2

,Name,Age,Department,Position,Years_Experience,Salary,Performance_Rating,Projects_Completed,Hours_Worked_Per_Week,Education,Location,Skills
0,Krrish,28,Engineering,Senior Developer,5,95000,4.5,23,42,Masters,Bangalore,Python|JavaScript|React
1,Samay,32,Marketing,Marketing Manager,7,88000,4.2,18,38,Bachelors,Mumbai,SEO|Analytics|Content
3,Adarsh,35,Finance,Financial Analyst,10,105000,4.8,31,45,MBA,Delhi,Excel|SAP|Forecasting
4,Prabh,29,Design,Lead Designer,6,82000,4.6,27,39,Bachelors,Hyderabad,Figma|Adobe|UI/UX
5,MoneyBhai,41,Finance,CFO,15,185000,4.9,45,50,MBA,Mumbai,Strategy|Finance|Leadership

In [50]:
df2.iloc[2]
# df2.loc[2] will give error since 2 no. label doesnt exist in df2

Name                                    Adarsh
Age                                         35
Department                             Finance
Position                     Financial Analyst
Years_Experience                            10
Salary                                  105000
Performance_Rating                         4.8
Projects_Completed                          31
Hours_Worked_Per_Week                       45
Education                                  MBA
Location                                 Delhi
Skills                   Excel|SAP|Forecasting
Name: 3, dtype: object